datas/excel/MiscService.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><DoRoomPost xmlns="http://tempuri.org/"><hotelCd>cpcs01</hotelCd><acctNum>1000016</acctNum><transDs><xs:schema id="NewDataSet" xmlns="" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:msdata="urn:schemas-microsoft-com:xml-msdata"><xs:element name="NewDataSet" msdata:IsDataSet="true" msdata:UseCurrentLocale="true"><xs:complexType><xs:choice minOccurs="0" maxOccurs="unbounded"><xs:element name="hskpbill"><xs:complexType><xs:sequence><xs:element name="Htl_cd" type="xs:string" minOccurs="0" /><xs:element name="Bill_id" type="xs:string" minOccurs="0" /><xs:element name="Trn_dt" type="xs:dateTime" minOccurs="0" /><xs:element name="Trn_cd" type="xs:string" minOccurs="0" /><xs:element name="Bill_no" type="xs:string" minOccurs="0" /><xs:element name="Bill_amt" type="xs:decimal" minOccurs="0" /><xs:element name="Disc_pcnt" type="xs:decimal" minOccurs="0" /><xs:element name="Disc_amt" type="xs:decimal" minOccurs="0" /><xs:element name="Disc_rs" type="xs:string" minOccurs="0" /><xs:element name="Srv_pcnt" type="xs:decimal" minOccurs="0" /><xs:element name="Srv_amt" type="xs:decimal" minOccurs="0" /><xs:element name="Rm_num" type="xs:string" minOccurs="0" /><xs:element name="Acct_num" type="xs:string" minOccurs="0" /><xs:element name="Oper_dt" type="xs:dateTime" minOccurs="0" /><xs:element name="Oper_cd" type="xs:string" minOccurs="0" /><xs:element name="Oper_nm" type="xs:string" minOccurs="0" /><xs:element name="notice" type="xs:string" minOccurs="0" /></xs:sequence></xs:complexType></xs:element><xs:element name="hskptransact"><xs:complexType><xs:sequence><xs:element name="Htl_cd" type="xs:string" minOccurs="0" /><xs:element name="Trn_dt" type="xs:dateTime" minOccurs="0" /><xs:element name="Trn_cd" type="xs:string" minOccurs="0" /><xs:element name="Bill_id" type="xs:string" minOccurs="0" /><xs:element name="Item_cd" type="xs:string" minOccurs="0" /><xs:element name="Item_nm" type="xs:string" minOccurs="0" /><xs:element name="Item_cnt" type="xs:decimal" minOccurs="0" /><xs:element name="Item_unit" type="xs:string" minOccurs="0" /><xs:element name="Item_amt" type="xs:decimal" minOccurs="0" /><xs:element name="Srv_amt" type="xs:decimal" minOccurs="0" /><xs:element name="Disc_amt" type="xs:decimal" minOccurs="0" /><xs:element name="Plu_cd" type="xs:string" minOccurs="0" /><xs:element name="Oper_dt" type="xs:dateTime" minOccurs="0" /><xs:element name="Oper_cd" type="xs:string" minOccurs="0" /><xs:element name="trn_id" type="xs:int" minOccurs="0" /><xs:element name="Send_flg" type="xs:string" minOccurs="0" /><xs:element name="Send_opercd" type="xs:string" minOccurs="0" /><xs:element name="Send_opernm" type="xs:string" minOccurs="0" /><xs:element name="Adjtrn_cd" type="xs:string" minOccurs="0" /></xs:sequence></xs:complexType></xs:element></xs:choice></xs:complexType></xs:element></xs:schema><diffgr:diffgram xmlns:msdata="urn:schemas-microsoft-com:xml-msdata" xmlns:diffgr="urn:schemas-microsoft-com:xml-diffgram-v1"><NewDataSet xmlns=""><hskpbill diffgr:id="hskpbill1" msdata:rowOrder="0" diffgr:hasChanges="inserted"><Trn_dt>2016-01-13T00:00:00+08:00</Trn_dt><Trn_cd>201</Trn_cd><Bill_no>21820191126111209</Bill_no><Bill_amt>10.00</Bill_amt><Disc_pcnt>10.0</Disc_pcnt><Disc_amt>1</Disc_amt><Disc_rs>ceshi</Disc_rs><Srv_pcnt>10.0</Srv_pcnt><Srv_amt>1.00</Srv_amt><Rm_num>218</Rm_num><Oper_cd>9897</Oper_cd><Oper_nm>超级用户</Oper_nm><notice /></hskpbill><hskptransact diffgr:id="hskptransact1" msdata:rowOrder="0" diffgr:hasChanges="inserted"><Trn_cd>201</Trn_cd><Item_cd>1001</Item_cd><Item_nm>雪花啤酒</Item_nm><Item_cnt>1</Item_cnt><Item_unit /><Item_amt>10.00</Item_amt><Srv_amt>1.00</Srv_amt><Disc_amt>1.00</Disc_amt><Plu_cd>201</Plu_cd><Oper_cd>9897</Oper_cd><Send_opercd /><Send_opernm /><Adjtrn_cd /></hskptransact></NewDataSet></diffgr:diffgram></transDs><flag>1</flag><ischeckamt>true</ischeckamt></DoRoomPost></soap:Body></soap:Envelope>